src/cf/InformationRegisters/пбп_ОжиданиеАсинхронныхВызовов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>пбп_ОжиданиеАсинхронныхВызовов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсходящееСообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИсторияИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_СтатусыАсинхронныхВызовов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВызова</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.пбп_Пользователи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/пбп_ОжиданиеАсинхронныхВызовов/Ext/ManagerModule.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить записи
//
// Параметры:
//  ИдентификаторСообщения	 - Строка	 - уникальный иденотификатор сообщения обмена
// 
// Возвращаемое значение:
//  ТаблицаЗначений - данные регистра ожидания асинхронных вызовов
//
Функция ПолучитьЗаписи(ИдентификаторСообщения = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	пбп_ОжиданиеАсинхронныхВызовов.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	пбп_ОжиданиеАсинхронныхВызовов.ИсходящееСообщение КАК ИсходящееСообщение,
	|	пбп_ОжиданиеАсинхронныхВызовов.Статус КАК Статус,
	|	пбп_ОжиданиеАсинхронныхВызовов.ДатаВызова КАК ДатаВызова,
	|	пбп_ОжиданиеАсинхронныхВызовов.ОписаниеОшибки КАК ОписаниеОшибки,
	|	пбп_ОжиданиеАсинхронныхВызовов.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.пбп_ОжиданиеАсинхронныхВызовов КАК пбп_ОжиданиеАсинхронныхВызовов";
	
	Если ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
		
		УсловияЗапроса = "пбп_ОжиданиеАсинхронныхВызовов.ИдентификаторСообщения = &ИдентификаторСообщения";
		Запрос = пбп_СхемыЗапросов.ДобавитьОтборВЗапрос(Запрос, УсловияЗапроса);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыгрузкаРезультатаЗапроса = РезультатЗапроса.Выгрузить();
	
	Возврат ВыгрузкаРезультатаЗапроса;
	
КонецФункции

// Добавить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * ИдентификаторСообщения - Строка - уникальный идентификатор сообщения обмена
//   * ИсходящееСообщение - СправочникСсылка.пбп_ИсторияИнтеграции - история интеграции исх. сообщения
//   * Статус - ПеречислениеСсылка.пбп_СтатусыАсинхронныхВызовов - статус вызова
//   * ДатаВызова - Дата - дата вызова
//   * ОписаниеОшибки - Строка - текст ошибки асинх вызова
//
Процедура ДобавитьЗапись(ПараметрыЗаписи) Экспорт
	
	Если ТипЗнч(ПараметрыЗаписи) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru='Некорректный тип параметра'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ИдентификаторСообщения) Тогда
		ВызватьИсключение НСтр("ru='Не указан идентификатор сообщения'");
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи);
		
		МенеджерЗаписи.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Ошибка добавления записи ожидания асинхронных вызовов'");
		пбп_Переадресация.ДобавитьСообщениеДляЖурналаРегистрации(
			ТекстСообщения,
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Изменить запись.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - набор параметров Для записи. Ключи:
//   * ИдентификаторСообщения - Строка - уникальный идентификатор сообщения обмена
//   * ИсходящееСообщение - СправочникСсылка.пбп_ИсторияИнтеграции - история интеграции исх. сообщения
//   * Статус - ПеречислениеСсылка.пбп_СтатусыАсинхронныхВызовов - статус вызова
//   * ДатаВызова - Дата - дата вызова
//   * ОписаниеОшибки - Строка - текст ошибки асинх вызова
//
Процедура ИзменитьЗапись(ПараметрыЗаписи) Экспорт
	
	Если ТипЗнч(ПараметрыЗаписи) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru='Некорректный тип параметра'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ИдентификаторСообщения) Тогда
		ВызватьИсключение НСтр("ru='Не указан идентификатор сообщения'");
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ПараметрыЗаписи.ИдентификаторСообщения);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		Для Каждого КлючИЗначение Из ПараметрыЗаписи Цикл
			Запись[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЦикла;
		
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Удалить запись.
// 
// Параметры:
//  ИдентификаторСообщения - Строка - уникальный идентификатор сообщения обмена
//
Процедура УдалитьЗаписи(ИдентификаторСообщения) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		ВызватьИсключение НСтр("ru='Не указан идентификатор сообщения'");
	КонецЕсли;
	
	Попытка
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
		
		НаборЗаписей.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Ошибка удаления записи ожидания асинхронных вызовов'");
		пбп_Переадресация.ДобавитьСообщениеДляЖурналаРегистрации(
			ТекстСообщения,
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли
